# Книги на прочтение 📚🌶️
# Ученики 10‑го класса онлайн-школы BEEGEEK получили задание прочитать за летние каникулы три книги:

# «Что такое математика?»
# «Математическая составляющая»
# «100 гениальных идей по математике»
# Известны следующие данные:

# n учеников прочитали первую книгу,
# m учеников — вторую,
# k учеников — третью,
# x учеников прочитали первую или вторую (или обе),
# y учеников прочитали вторую или третью (или обе),
# z учеников прочитали первую или третью (или обе),
# t учеников прочитали все три книги,
# Всего в 10‑м классе учится a учеников.
# Напишите программу, которая определяет, сколько учеников:

# Прочитали только одну книгу,
# Прочитали ровно две книги,
# Не прочитали ни одной из рекомендованных книг.
# Формат входных данных
# На вход подаются восемь целых чисел, каждое на отдельной строке:


# Формат выходных данных
# Программа должна вывести три целых числа, каждое на отдельной строке:

# Количество учеников, прочитавших ровно одну книгу,
# Количество учеников, прочитавших ровно две книги,
# Количество учеников, не прочитавших ни одной книги.

numbers = {2.1, 2, 4, 6, 6}
print('Сумма всех элементов множества =', sum(numbers))